test_case/pitzDaily_simpleFoam_OnRunCorrectBC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
//	inlet
//	{
//	type            fixedValue;
//	value           uniform (10 0 0);
//	}

	inlet
	{
        type            codedFixedValue;
        name		flowControl;
        value		uniform (0 0 0);
        code
        #{
        	const dictionary& flowControl = db().lookupObject<IOdictionary>("flowControl");
        	vector U_new = flowControl.lookup("U_new");
        	const fvPatch& boundaryPatch = patch();
        	fvPatchField<vector>& pField = *this;
        	
                forAll(pField, i)
            	{
                	pField[i] = U_new;
            	}
        
        #};
	}
	outlet
	{
	type            zeroGradient;
	}

	upperWall
	{
	type            noSlip;
	}

	lowerWall
	{
	type            noSlip;
	}

	frontAndBack
	{
	type            empty;
	}
}

// ************************************************************************* //
